{"identifier":"trails_by_","label":"trails_by_","items":[{"id":1,"trail_name":"3 Park Loop","difficulty_num":2,"character":" Scenic, Natural, Historic, Wilderness, Town and Country","difficulty":2,"activities":"Hiking & Walking, Cycling - Off-Road, Cross Country Skiing","nearbyamenities":" Skate Trail, Benches, Parking, Trailhead","length":"8.5 km","closest_town":"Moonbeam","longitude_num":-82.165976,"latitude_num":49.376293,"description":"The many natural features of this 8.5 kilometer loop make it totally unique. Hikers will, in turn, walk alongside Twin Lake camping site and park slides, Holiday Bay Park, Ouellette Bay shores and cross over to the Villeneuve Pit where they can contemplate a remarkable naturally eroded basin that dates back to the Ice Age. The steep slopes and overall sinuosity of this course make it an exciting challenge. Partially asphalted, it is accessible to: pedestrians, mountain bikers and horseback riders. Rated: Intermediate \r\n\r\nMoonbeam nature trails offers a whole series of trails of great beauty which will stimulate the curiosity and enhance the will of solitary walkers who seek meditation or groups and families which practice this activity together in order to learn and socialize while keeping fit. We hope to see you there! \r\n\r\nInformation provided by the Moonbeam nature trails website. \r\n\r\nFor more information on trails or to view a trail video by activity please go to the OTC Youtube Channel \r\n\r\n \r\n\r\nDirections: Follow Hwy 581, turn left at Twin Lakes. Or continue and turn left at the chapel. Enjoy the trail. \r\n\r\nOntario Trails do not own or manage any trails. Check with the identified manager before using this trail. Do not trespass, allowed uses only. \r\n\r\nFor more information on trails or to view a trail video by activity please go to the OTC Youtube Channel \r\n\r\n \r\n\r\nFor more information on the great sport of snowshoeing please see our partner Snowshoe Canada \r\n","surface":"Paved, Gravel","masthead_image_1":"\/assets\/images\/trails\/nereigion\/ne3parkloop\/ne3parkloopmasthead\/NE3ParkLoop%5F1L.jpg","masthead_image":"\/assets\/images\/trails\/nereigion\/ne3parkloop\/ne3parkloopmasthead\/NE3ParkLoop%5F1L.jpg"}